### Translation file for page: https://www.rust-lang.org/policies/media-guide
### templates/policies/media-guide.hbs


## Page title

policies-media-guide-page-title = Руководство по политике в отношении логотипов и СМИ

## Art license

media-guide-art-license-heading = Лицензия на графику
media-guide-art-license-description = <p>Логотипы Rust и Cargo (растровые и векторные) принадлежат Mozilla и распространяются на условиях <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution license (CC-BY)</a>. Это наиболее разрешительная лицензия Creative Commons, которая позволяет повторно использовать и модифицировать её для любых целей. Ограничения заключаются в том, что дистрибьюторы должны «предоставить соответствующий кредит, предоставить ссылку на лицензию и указать, были ли внесены изменения». <strong>Обратите внимание, что использование этих логотипов и названий Rust и Cargo также регулируется товарным знаком; наша политика в отношении товарных знаков описана ниже</strong>.</p>

## Trademark policy

media-guide-trademark-policy-heading = Политика в отношении товарных знаков
media-guide-trademark-policy-description =
    <p>Названия и бренды Rust и Cargo позволяют говорить о том, что официально является частью сообщества Rust, а что нет. Поэтому мы внимательно относимся к тому, где мы позволяем им появляться. Но в то же время мы хотим максимально полно использовать эти бренды. Политика, изложенная здесь, объясняет, как мы соблюдаем баланс. Если вы хотите использовать эти названия или бренды, особенно в коммерческих целях, прочитайте эту страницу или не стесняйтесь <a href="mailto:trademark@rust-lang.org">обратиться</a> и спросить нас об этом!</p>
    <p><b>TL;DR</b>: Большинство некоммерческих видов использования названий и логотипов Rust/Cargo разрешены и не требуют разрешения. Для большинства коммерческих целей требуется разрешение. В любом случае самое важное правило заключается в том, что использование товарных знаков не может быть официальным или подразумевать одобрение со стороны проекта Rust.</p>
    <p>Если у вас есть какие-либо сомнения относительно того, требует ли ваше предполагаемое использование товарного знака Rust разрешение, свяжитесь с нами по адресу { EMAIL("trademark@rust-lang.org") }.</p>
    <p>Этот документ был частично получен из <a href="https://www.python.org/psf/trademarks/">Python Software Foundation Trademark Usage Policy</a>. Этот документ не является официальным заявлением о политике в отношении товарных знаков Mozilla, но служит для разъяснения политики в отношении товарных знаков Mozilla в отношении Rust.</p>

## The Rust trademarks

media-guide-rust-trademarks-heading = Торговые марки Rust
media-guide-rust-trademarks-description =
    <p>Язык программирования Rust - это проект сообщества с открытым исходным кодом, управляемый основной командой. Он также спонсируется Mozilla Foundation (“Mozilla”), который владеет и защищает торговые марки и логотипы Rust и Cargo («Торговые марки Rust»). В этом документе содержится информация об использовании товарных знаков Rust, характерных для языка программирования, а также примеры распространённых способов использования этих товарных знаков людьми, с пояснениями относительно того, разрешено ли такое использование или нет, или требуется разрешение. Этот документ дополняет <a href="https://www.mozilla.org/foundation/trademarks/policy/">официальную политику Mozilla в отношении товарных знаков</a> которая регулирует использование всех товарных знаков Mozilla.</p>
    <p>Товарные знаки Rust включают в себя два словесных знака и два логотипа:</p>
    <ul>
      <li>Rust</li>
      <li>Cargo</li>
      <li><img src="/logos/rust-logo-blk.svg" alt="{ media-guide-rust-trademarks-rust-img-alt }"></li>
      <li><img src="/logos/cargo.png" alt="{ media-guide-rust-trademarks-cargo-img-alt }"></li>
    </ul>
    <p>Товарные знаки - это названия и образцы, которые говорят миру об источнике товара или услуги. Защита торговых марок для проекта с открытым исходным кодом особенно важна. Любой может изменить исходный код и создать продукт из этого кода, поэтому важно, чтобы только оригинальный продукт или варианты, одобренные проектом, использовали товарные знаки проекта. Ограничивая использование товарных знаков Rust, Mozilla и проект Rust могут помочь пользователям и разработчикам узнать, что они получают продукт, произведённый проектом Rust, а не изменённую версию другого лица. Товарный знак гарантирует пользователям и разработчикам качество и безопасность используемого ими продукта.</p>
media-guide-rust-trademarks-rust-img-alt = Логотип Rust
media-guide-rust-trademarks-cargo-img-alt = Логотип cargo

## Using the trademarks

media-guide-tm-use-heading = Использование товарных марок
media-guide-tm-use-appearance-heading = Официальный, аффилированный или одобренный вид
media-guide-tm-use-appearance-description =
    <p>Самое основное правило заключается в том, что торговые марки Rust нельзя использовать способами, которые кажутся (стороннему наблюдателю) официальными, аффилированными или одобренными проектом Rust или Mozilla, если у вас нет письменного разрешения от основной команды Rust. Это основной способ защитить пользователей и разработчиков от путаницы.</p>
    <p>Поскольку это правило касается управления восприятием, оно субъективно, и его трудно конкретизировать. Есть несколько очевидных способов избежать проблем, например, включить слово «неофициальный» на видном месте, но если у вас есть какие-либо сомнения, мы будем более чем рады помочь: просто отправьте электронное письмо по адресу { EMAIL("trademark@rust-lang.org") }.</p>
media-guide-tm-use-basics-heading = Основы: ссылки на Rust или Cargo
media-guide-tm-use-basics-description =
    <p>Как и в случае с любым товарным знаком, слова Rust и Cargo можно использовать с минимальными ограничениями для обращения к языку программирования Rust, а также к диспетчеру и реестру пакетов Cargo.</p>
    <p>Они не могут быть использованы:</p>
    <ul>
      <li>для ссылки на любой другой язык программирования;</li>
      <li>если вводят в заблуждение или могут подразумевать ассоциацию несвязанных модулей, инструментов, документации или других ресурсов с языком программирования Rust;</li>
      <li>таким образом, чтобы сообщество не понимало, является ли язык программирования Rust открытым исходным кодом и может ли он свободно использоваться.</li>
    </ul>
media-guide-tm-use-implicit-approval-heading = Использование, которое не требует явного одобрения
media-guide-tm-use-implicit-approval-description =
    <p>Существует множество вариантов использования, которые не требуют явного одобрения. <strong>Однако во всех случаях, описанных ниже, вы должны убедиться, что использование товарных знаков Rust не является официальным, как объяснено выше.</strong></p>
    <ul>
      <li>Допускается точное указание того, что программное обеспечение написано на языке программирования Rust, что оно совместимо с языком программирования Rust или содержит язык программирования Rust. В этих случаях вы можете использовать торговые марки Rust для указания этого без предварительного одобрения. Это верно как для некоммерческого, так и для коммерческого использования.</li>
      <li>Использование товарных знаков Rust в названиях некоммерческих продуктов, таких как RustPostgres или Rustymine, или в имени репозиториев кода, например, GitHub, разрешается при обращении к использованию или пригодности для языка программирования Rust. Такое использование может также включать логотип Rust, даже в изменённом виде. Для коммерческих продуктов (включая краудфандинговые или спонсорские), пожалуйста, уточните на { EMAIL("trademark@rust-lang.org") }, чтобы убедиться, что ваше использование не выглядит официальным.</li>
      <li>Использование товарных знаков Rust на футболках, шляпах и других художественных работах или товарах, даже в изменённой форме, разрешено для личного использования или для использования небольшой группой членов сообщества, если они не продаются. Если вы хотите распространять товары с торговыми марками Rust на мероприятии, связанном с Rust, пожалуйста, свяжитесь с нами для получения разрешения по адресу { EMAIL("trademark@rust-lang.org") }.</li>
      <li>Использование торговых марок Rust (даже в изменённой форме) для общественных мероприятий, таких как встречи, учебные пособия и т.п., разрешено для мероприятий, которые можно посещать бесплатно. Для коммерческих событий (в том числе спонсируемых), пожалуйста, уточните на { EMAIL("trademark@rust-lang.org") }. Событие <strong>не может быть официально одобрено или проведено проектом Rust</strong> без письменного разрешения.</li>
      <li>Использование товарных знаков Rust в книгах или публикациях, таких как «Rust Journal» или «Rust Cookbook», разрешено.</li>
      <li>Использование слова «Rust» на веб-сайтах, в брошюрах, документации, научных статьях, книгах и упаковке продуктов для обозначения языка программирования Rust или проекта Rust разрешено.</li>
    </ul>
media-guide-tm-use-explicit-approval-heading = Использование, которое требует явного разрешения
media-guide-tm-use-explicit-approval-description =
    <ul>
      <li>Распространение модифицированной версии языка программирования Rust или диспетчера пакетов Cargo и его называние Rust или Cargo требует явного письменного разрешения от основной команды Rust. Мы обычно разрешаем такое использование, если изменения (1) относительно малы и (2) очень чётко сообщены конечным пользователям.</li>
      <li>Продажа футболок, головных уборов и других произведений искусства или товаров требует явного письменного разрешения от основной команды Rust. Мы обычно разрешаем такое использование, если (1) чётко указано, что товар никоим образом не является официальной частью проекта Rust, и (2) чётко указано, приносит ли прибыль выгоды проекту Rust.</li>
      <li>Использование товарных знаков Rust в другом товарном знаке требует письменного разрешения от основной команды Rust, за исключением случаев, описанных выше.</li>
      <li>Слова «RustCamp», «RustCon» или «RustConf» не могут использоваться без явного разрешения.</li>
    </ul>

## Helping out

media-guide-helping-out-heading = Как мы можете нам помочь
media-guide-helping-out-description =
    <p>Как член сообщества Rust, следите за сомнительным использованием логотипа Rust и слова «Rust». Вы можете сообщить о возможном неправильном использовании по адресу { EMAIL("trademark@rust-lang.org") }. Мы оценим каждый случай и примем соответствующие меры.</p>
    <p>Пожалуйста, не обращайтесь к пользователям товарных знаков с жалобой. Это следует оставить Mozilla и её представителям. Спасибо!</p>
    <p>Если у вас есть конкретный вопрос или проблема по поводу продвижения Rust или использования его товарных знаков, пожалуйста, свяжитесь с Rust Core Team.</p>
media-guide-helping-out-link = Написать в Core Team
