### Translation file for page: https://www.rust-lang.org/policies/code-of-conduct


## templates/policies/code-of-conduct.hbs

policies-code-of-conduct-page-title = 行動規範
coc-conduct-heading = 行動
coc-conduct-description =
    <ul>
      <li>私たちは、経験のレベル、性同一性および表現、性的指向、障害、個人の容姿、体格、人種、民族、年齢、宗教、国籍、その他の特徴にかかわらず、友好的かつ安全ですべての人を歓迎する環境を提供することに尽力します。</li>
      <li>過度に性的な偽名またはニックネームを使わないでください。友好的かつ安全ですべての人を歓迎する環境を損なうかもしれません。</li>
      <li>親切かつ丁寧に行動してください。意地悪や無礼をする必要はありません。</li>
      <li>人々には意見の相違があり、すべての設計または実装の選択にはトレードオフと数多のコストがかかることを尊重してください。正解はめったにありません。</li>
      <li>構造化されていない批評は最小限に留めてください。試してみたい確固たるアイデアがある場合は、フォークを作り、どのように動作するか確認してください。</li>
      <li>私たちは、あなたが誰かを侮辱し屈辱を与え、ハラスメントをした場合に、あなたを対話から除外します。それは歓迎的な行いではありません。「ハラスメント」という用語は、<a href="https://github.com/stumpsyn/policies/blob/master/citizen_code_of_conduct.md">市民行動規範</a>の定義を含むものと解釈します。その概念に何が含まれているのか明確でない場合は、その定義を読んでください。特に、社会的に疎外された人々を排除する行動は容認しません。</li>
      <li>個人的なハラスメントも容認されません。誰であっても、あなたがコミュニティメンバーにハラスメントを受けているか、または不快にさせられていると感じた場合は、ただちにチャンネル担当者または { $coc-rust-moderation-team-anchor } のいずれかに連絡してください。あなたが常連の寄稿者であろうと、新規参入者であろうと、私たちはこのコミュニティをあなたにとって安全な場所にすることに気を配っています。あなたには私たちがついています。</li>
      <li>同様に、いかなるスパム、荒らし行為、感情的な言動、釣り行為、その他の注意を反らす行為も歓迎されるものではありません。</li>
    </ul>
coc-conduct-description-team-anchor-text = Rustモデレーションチーム
coc-conduct-email-button = Rustモデレーションチームにメールを送る
coc-moderation-heading = モデレーション
coc-moderation-description =
    <p>これらは、コミュニティの行動基準を維持するためのポリシーです。スレッドにモデレーションが必要だと感じる場合は、{ $coc-rust-moderation-team-anchor }に連絡してください。</p>
    <ol>
      <li>悪意のある、人を傷つける、圧制的、あるいは排他的な発言など、Rustの行動基準に反する発言は容認されません。（よくない言葉を使うことはできますが、決して他のユーザーに向けて発言したり、悪意を持って使ったりしてはいけません。）</li>
      <li>モデレーターが不適切だと判断した発言は、行動規範に記載されているかどうかに関わらず、容認されません。</li>
      <li>モデレーターはそのような発言に対しては、まず警告を発します。</li>
      <li>警告が無視された場合は、そのユーザーは「キック」されます。つまり、落ち着かせるためにコミュニケーションチャネルから追放します。</li>
      <li>そのユーザーが戻ってきてもなおトラブルを起こす場合は、そのユーザーは「BAN」されます。言い換えると、無期限に除外されます。</li>
      <li>もしそれがそのユーザーの最初の違反行為で、被害を受けたユーザーに心からの謝罪をするのであれば、モデレーターは彼らの裁量でそのユーザーのBANを解除することができます。</li>
      <li>モデレーターが誰かをBANしていて、それを不当なものだと思った場合は、そのモデレーターあるいは別のモデレーターと<strong>プライベートな場所で</strong>やり取りしてください。チャンネル内でのBANに関する苦情は認められません。</li>
      <li>モデレーターは他のコミュニティメンバーよりも高い基準に拘束されます。モデレーターが不適切な言動をとった場合、他のユーザーよりも厳しい対応が求められます。</li>
    </ol>
    <p>Rustコミュニティでは、お互いに気を配るためのさらなる一歩を踏み出そうと努力しています。技術的に非の打ち所がないだけではなく、最高の自分になりましょう。特に、攻撃的あるいはセンシティブな問題、とりわけ話題から外れているような問題には触れないようにしてください。これは、非常に多くの場合、不必要な争い、感情の傷つき、そして信用の喪失につながるためです。さらに悪いことに、人々をコミュニティから完全に遠ざけてしまうこともあります。</p>
    <p>そして、誰かがあなたの言動に異を唱えたら、自衛に走ろうとする衝動を抑えましょう。指摘された言動をやめて、謝りましょう。誤解されている、あるいは不当に非難されていると感じた場合でも、よりよいコミュニケーションをとることができた可能性は高いです。あなたの仲間であるRustaceansが快適だと感じられるようにするのは、あなたの責任だということを覚えておいてください。誰もが仲良くしたいと思っていますし、何よりもまず、素晴らしい技術について話したいがために、私たちはここにいます。あなたが信頼されている限り、人々は善意を持って寛容に接することを心がけてくれるでしょう。</p>
    <p>上記の実施方針は、Discordチャンネル（https://discord.gg/rust-lang）、rust-lang/rust-lang-nursery/rust-lang-deprecatedの管理下にあるGitHubリポジトリ、そしてrust-lang.orgの管理下にあるすべてのフォーラム（users.rust-lang.org、internals.rust-lang.org）を含むすべてのRustの公式の場で適用されます。Rustの行動規範を適用している他のプロジェクトについては、それぞれのプロジェクトのメンテナに連絡して実施してください。この行動規範をあなたのプロジェクトで使いたい場合は、混乱を避けるために、あなた自身のモデレーションポリシーに明示的に言及するか、それをコピーすることを検討してください。</p>
    <p><i><a href="http://blog.izs.me/post/30036893703/policy-on-trolling">Node.js Policy on Trolling</a>と<a href="https://www.contributor-covenant.org/version/1/3/0/">Contributor Covenant v1.3.0</a>から改変。</i></p>
coc-moderation-description-team-anchor-text = Rustモデレーションチーム
