### Translation file for page: https://www.rust-lang.org/policies/code-of-conduct


## templates/policies/code-of-conduct.hbs

policies-code-of-conduct-page-title = Правила поведения
coc-conduct-heading = Поведение
coc-conduct-description =
    <ul>
      <li>Мы стремимся обеспечить дружественную, безопасную и гостеприимную среду для всех, независимо от уровня опыта, гендерной идентичности и самовыражения, сексуальной ориентации, инвалидности, внешнего вида, размера тела, расы, этнической принадлежности, возраста, религии, национальности или других подобных характеристик.</li>
      <li>Пожалуйста, избегайте использования откровенно сексуальных псевдонимов или других псевдонимов, которые могут для всех ухудшить дружескую, безопасную и гостеприимную среду.</li>
      <li>Пожалуйста, будьте добры и вежливы. Не нужно быть грубым.</li>
      <li>Уважайте то, что люди расходятся во мнениях и что каждый выбор дизайна или реализации влечёт за собой компромисс и многочисленные затраты. Правильный ответ редко бывает.</li>
      <li>Пожалуйста, сведите к минимуму неструктурированную критику. Если у вас есть идеи, с которыми вы хотите поэкспериментировать, сделайте форк и посмотрите, как они работают.</li>
      <li>Мы исключим вас из взаимодействия, если вы оскорбляете, унижаете или оскорбляете кого-либо. Это не приветствуется. Мы понимаем термин «домогательства», как определяется в <a href="https://github.com/stumpsyn/policies/blob/master/citizen_code_of_conduct.md">Citizen Code of Conduct</a>. Если у вас нет ясности относительно того, что может быть включено в эту концепцию, пожалуйста, прочитайте их определение. В частности, мы не терпим поведения, которое исключает людей из социально маргинализированных групп.</li>
      <li>Частное домогательство также недопустимо. Независимо от того, кто вы, если вы чувствуете, что вас кто-то беспокоил, или кто-то беспокоит вас или кто-то чувствует себя неудобно, немедленно свяжитесь с одним из сотрудников канала или с { $coc-rust-moderation-team-anchor }. Неважно, являетесь ли вы постоянным участником или новичком, мы заботимся о том, чтобы сделать это сообщество безопасным для вас, и мы вас поддержим.</li>
      <li>Точно так же не приветствуются спам, троллинг, флейм, травлю или другие виды кражи внимания.</li>
    </ul>
coc-conduct-description-team-anchor-text = Команда модераторов Rust
coc-conduct-email-button = Написать в Moderation Team
coc-moderation-heading = Модерация
coc-moderation-description =
    <p>Это политика соблюдения стандартов поведения нашего сообщества. Если вы чувствуете, что тред нуждается в модерации, свяжитесь с { $coc-rust-moderation-team-anchor }.</p>
    <ol>
      <li>Замечания, нарушающие стандарты поведения Rust, в том числе ненавистные, оскорбительные, репрессивные или исключительные замечания, не допускаются. (Проклятия допускаются, но они никогда не должны быть нацелены на другого пользователя и никогда не должны быть ненавистным.)</li>
      <li>Замечания, которые модераторы считают неуместными, независимо от того, указаны они в кодексе поведения или нет, также не допускаются.</li>
      <li>Модераторы сначала ответят на такие замечания предупреждением.</li>
      <li>Если предупреждение не будет услышано, пользователь будет «выгнан», то есть выгнан из канала связи чтобы остудил свой пыл.</li>
      <li>Если пользователь вернётся и продолжит создавать проблемы, он будет заблокирован, то есть исключён на неопределённый срок.</li>
      <li>Модераторы могут по своему усмотрению отменить запрет пользователя, если это было первым нарушением, и принести обиженной стороне искренние извинения.</li>
      <li>Если модератор кого-то запрещает, и вы считаете, что это неоправданно, обратитесь к этому модератору или другому модератору, <strong>в частном порядке</strong>. Жалобы на запреты в канале не допускаются.</li>
      <li>Модераторы придерживаются более высоких стандартов, чем другие участники сообщества. Если модератор создаёт неуместную ситуацию, он должен ожидать меньшую свободу действий, чем другие.</li>
    </ol>
    <p>В сообществе Rust мы стремимся сделать ещё один шаг, чтобы заботиться друг о друге. Не стремитесь быть технически безупречными, старайтесь быть самим собой. В частности, избегайте заигрывать с оскорбительными или деликатными вопросами, особенно если они не по теме; это слишком часто приводит к ненужным дракам, обидным чувствам и подрыву доверия; хуже того, это может полностью оттолкнуть людей от сообщества.</p>
    <p>И если кто-то не согласен с тем, что вы сказали или сделали, не поддавайтесь желанию защищаться. Просто прекратите делать то, на что они жаловались, и извинитесь. Даже если вы чувствуете, что вас неправильно истолковали или несправедливо обвинили, велика вероятность того, что вы могли лучше донести информацию - помните, что вы несёте ответственность за то, чтобы ваши друзья-Растациане были довольны. Все хотят ладить, и мы все здесь, в первую очередь, потому что мы хотим поговорить о крутых технологиях. Вы обнаружите, что люди будут стремиться к добрым намерениям и прощать, если вы заслужили их доверие.</p>
    <p>Политики принудительного исполнения, перечисленные выше, распространяются на все официальные площадки, включая каналы Discord (https://discord.gg/rust-lang); GitHub репозитории организаций rust-lang, rust-lang-nursery и rust-lang-deprecated и все форумы rust-lang.org (users.rust-lang.org, internals.rust-lang.org). Для других проектов, принимающих Кодекс поведения Rust, пожалуйста, свяжитесь с разработчиками этих проектов для обеспечения исполнения. Если вы хотите использовать этот кодекс поведения для своего собственного проекта, рассмотрите возможность явного упоминания вашей политики модерации или создания копии с вашей собственной политикой модерации, чтобы избежать путаницы.</p>
    <p><i>Адаптировано из <a href="http://blog.izs.me/post/30036893703/policy-on-trolling">Node.js Policy on Trolling</a>, а также из <a href="https://www.contributor-covenant.org/version/1/3/0/">Contributor Covenant v1.3.0</a>.</i></p>
coc-moderation-description-team-anchor-text = Команда модераторов Rust
