### Translation file for page: https://www.rust-lang.org/policies/code-of-conduct

## templates/policies/code-of-conduct.hbs

policies-code-of-conduct-page-title = Code of conduct

coc-conduct-heading = 시행
coc-conduct-description =
        <ul>
          <li>우리는 경험, 성별 정체성 및 표현, 성적 성향, 장애, 외모, 신체 크기, 인종, 민족성, 연령, 종교, 국적 또는 다른 유사한 특징에 상관없이 모두에게 친근하고 안전하며 환영할 수 있는 환경을 제공하기 위해 노력하고 있습니다.</li>
          <li>친밀하고 안전하며 환영하는 환경에서 해가 될 수 있는 노골적인 성적인 별명이나 다른 별명을 사용하지 마십시오.</li>
          <li>친절하고 예의 바르게 행동하십시오. 심술궂게 굴거나 무례하게 굴 필요는 없습니다.</li>
          <li>사람들이 의견의 차이를 가지고 있고 모든 설계 또는 구현에는 절충과 수많은 비용이 수반된다는 것을 존중합니다. 정답은 없습니다.</li>
          <li>구조화되지 않은 비평은 최소한으로 유지하십시오. 실험하고 싶은 확고한 아이디어가 있다면 포크를 만들어 어떻게 작동하는지 알아보십시오.</li>
          <li>만약 당신이 누군가를 모욕하거나 비하하거나 괴롭힌다면 우리는 당신을 커뮤니티에서 제외시킬 것입니다. 그것은 환영받지 못하는 행동입니다. 우리는 "harassment"라는 용어가 <a href="http://citizencodeofconduct.org/">시민 행동 강령</a>의 정의를 포함하는 것으로 해석합니다. 만약 당신이 그 개념에 포함될 수 있는 것인지에 대해 명확하지 않다면, 정의를 읽으십시오. 특히, 우리는 사회적으로 소외된 집단의 사람들을 배제하는 행동을 용납하지 않습니다.</li>
          <li>사적인 괴롭힘도 용납할 수 없습니다. 당신이 누구든, 커뮤니 구성원으로부터 괴롭힘을 당했거나 불편하다고 느끼면, 채널 운영진 중 한 곳이나 { $coc-rust-moderation-team-anchor } 에 즉시 연락하십시오. 당신이 정규 기여자든 신인이든, 우리는 이 공동체를 당신에게 안전한 곳으로 만드는 것에 신경을 쓰고 있으며, 우리는 당신의 지지를 받고 있습니다.</li>
          <li>마찬가지로 스팸, 트롤링, 소란, 떡밥 또는 다른 주의를 끄는 행위 역시 환영받지 못합니다.</li>
        </ul>
coc-conduct-description-team-anchor-text = 러스트 조정팀
coc-conduct-email-button = 조정팀에 이메일 쓰기

coc-moderation-heading = 조정
coc-moderation-description =
        <p>이하의 내용은 우리 공동체의 행동 기준을 지지하기 위한 정책들이다. 절제가 필요하다고 생각되면 { $coc-rust-moderation-team-anchor }으로 연락하십시오.</p>
        <ol>
          <li>혐오스럽거나, 상처를 입히거나, 억압적이거나, 배척적인 발언 등 행동의 신뢰할 수 있는 기준을 위반하는 비고들은 허용되지 않습니다.(저주는 허용되나 다른 사용자를 겨냥하는 일은 절대 허용되지 않으며, 비난적 태도 또한 절대 하지말아주십시오.)</li>
          <li>행동 강령에 기재되어 있건 아니건, 조정자가 부적절하다고 판단하는 비고 또한 허용되지 않습니다.</li>
          <li>조정팀은 우선 이런 발언에 대해 경고로 대응할 것이다.</li>
          <li>경고에 주의하지 않으면 사용자는 "추방" 즉, 평화를 위해 커뮤니티에서 쫒겨나게 될 것입니다.</li>
          <li>사용자가 돌아와 계속 말썽을 피우면, 영원히 제명될 것입니다.</li>
          <li>조정팀원들은 재량에 따라 첫 번째 범죄이거나 기분이 상한 당사자에게 진정한 사과를 한 경우 사용자의 밴을 해제할 수 있습니다.</li>
          <li>조정팀원이 누군가를 밴하고 그것이 정당하지 않다고 생각하는 경우, <strong>개인적으로</strong> 그 진행자 또는 다른 진행자와 함께 처리하십시오. 채널 내 금지사항에 대한 불만사항은 허용되지 않습니다.</li>
          <li>조정팀은 다른 커뮤니티 구성원보다 더 높은 수준으로 유지됩니다. 만약 조정팀원이 부적절한 상황을 조성한다면, 그들은 다른 사람들보다 더 적은 권한을 기대해야 할 것입니다.</li>
        </ol>
        <p>러스트 커뮤니티에서 우리는 서로를 돌보기 위한 추가적인 단계로 가기 위해 노력합니다. 기술적으로 손댈수 없는 것을 목표로 하지 말고, 최선을 다하려고 노력하십시오. 특히, 주제에 벗어난 문제라면 공격적이거나 민감한 문제를 가지고 시시덕거리지 않도록 하십시오. 이것은 빈번한 불필요한 싸움과 서로의 감정을 상하게 하고 신뢰를 손상시킵니다. 더 나쁜 것은, 사람들을 공동체로부터 완전히 멀어지게 할 수 있습니다.</p>
        <p>그리고 만약 누군가가 당신이 말하거나 한 것을 문제삼는다면, 방어적이 되고 싶은 충동에 저항하십시오. 그들이 불평했던 행동을 그만하고 사과하십시오. 비록 당신이 오해받거나 부당하게 비난받았다고 느끼더라도, 당신이 더 잘 소통할 방법이 있었을 가능성이 큽니다. 동료 러스타시안을 편안하게 만드는 것은 당신의 책임이라는 것을 기억하십시오. 모두가 사이좋게 지내고 싶어하고니, 우리는 여기서 무엇보다도 멋진 기술에 대해 이야기하고 싶어하기 때문입니다. 당신은 그들의 신뢰를 얻는 한 사람들이 좋은 의도를 갖고 용서하기를 바라는 것이라는 것을 알게 될 것입니다.</p>
        <p>열거된 정책 러스트의 공식적 모든 베뉴에서도 적용됩니다. 디스코드 채널 (https://discord.gg/rust-lang), rust-lang, rust-lang-nursery, 그리고 rust-lang-deprecated 이하의 깃허브 리포지토리, 그리고 rust-lang.org 이하의 모든 포럼(users.rust-lang.org, internals.rust-lang.org). 신뢰할 수 있는 행동 강령을 채택하는 다른 프로젝트의 경우 해당 프로젝트의 유지 관리자에게 문의하여 시행하십시오. 만약 당신이 당신의 프로젝트에 이 행동 강령을 사용하길 원한다면, 혼란을 피하기 위해 당신의 절제 정책을 명시적으로 언급하거나 당신의 절제 정책을 사본으로 만드는 것을 고려하십시오.</p>
        <p><i><a href="http://blog.izs.me/post/30036893703/policy-on-trolling">Node.js 트롤링에 관한 정책</a>과 <a href="https://www.contributor-covenant.org/version/1/3/0/">기여자 규약 v1.3.0</a>으로부터 채택되었습니다.</i></p>

coc-moderation-description-team-anchor-text = 러스트 조정팀
