### Translation file for page: https://www.rust-lang.org/policies/code-of-conduct


## templates/policies/code-of-conduct.hbs

policies-code-of-conduct-page-title = Правила поведінки
coc-conduct-heading = Поведінка
coc-conduct-description =
    <ul>
      <li>Ми прагнемо забезпечити дружнє, безпечне та гостинне середовище для всіх, незалежно від рівня досвіду, ґендерної ідентичності та самовираження, сексуальної орієнтації, інвалідності, зовнішнього вигляду, розміру тіла, раси, етнічної приналежності, віку, релігії, національності або інших подібних характеристик.
      <li>Будь ласка, уникайте використання відверто сексуальних псевдонімів або інших псевдонімів, що можуть для всіх погіршити дружнє, безпечне та гостинне середовище.</li>
      <li>Будь ласка, будьте добрими та ввічливими. Не потрібно бути грубим.</li>
      <li>Поважайте те, що люди розходяться в думках і що кожен вибір дизайну або реалізації тягне за собою компроміс і численні витрати. Правильна відповідь рідко буває.</li>
      <li>Пажалуйста, зведіть до мінімуму неструктуровану критику. Якщо у вас є ідеї, з якими ви хочете поекспериментувати, зробіть форк і подивіться, як вони працюють.</li>
      <li>Ми виключимо вас із взаємодії, якщо ви ображаєте, принижуєте або ображаєте кого-небудь. Це не вітається. Ми розуміємо термін "домагання", як визначається в <a href="https://github.com/stumpsyn/policies/blob/master/citizen_code_of_conduct.md">Citizen Code of Conduct</a>. Якщо у вас немає ясності щодо того, що може бути включено в цю концепцію, будь ласка, прочитайте їх визначення. Зокрема, ми не терпимо поведінки, яка виключає людей із соціально маргіналізованих груп.
      <li>Поодинокі домагання також неприпустимі. Незалежно від того, хто ви, якщо ви відчуваєте, що вас хтось турбував, або хтось турбує вас, або хтось відчуває себе незручно, негайно зв'яжіться з одним зі співробітників каналу або з { $coc-rust-moderation-team-anchor }. Неважливо, чи є ви постійним учасником або новачком, ми дбаємо про те, щоб зробити цю спільноту безпечною для вас, і ми вас підтримаємо.</li>
      <li>Точно так само не вітаються спам, тролінг, флейм, цькування або інші види крадіжки уваги.</li>
    </ul>
coc-conduct-description-team-anchor-text = Команда модераторів Rust
coc-conduct-email-button = Написати в Moderation Team
coc-moderation-heading = Модерація
coc-moderation-description =
    <p>Це політика дотримання стандартів поведінки нашої спільноти. Якщо ви відчуваєте, що тред потребує модерації, зв'яжіться з { $coc-rust-moderation-team-anchor }.</p>
    <ol>
      <li>Зауваження, що порушують стандарти поведінки Rust, зокрема ненависні, образливі, репресивні або виняткові зауваження, не допускаються. (Прокльони допускаються, але вони ніколи не повинні бути націлені на іншого користувача і ніколи не повинні бути ненависними.)</li>.
      <li>Зауваження, які модератори вважають недоречними, незалежно від того, зазначені вони в кодексі поведінки чи ні, також не допускаються.
      <li>Модератори спочатку дадуть відповідь на такі зауваження попередженням.</li>
      <li>Якщо попередження не буде почуте, користувач буде "вигнаний", тобто вигнаний з каналу зв'язку щоб остудив свій запал.</li>
      <li>Якщо користувач повернеться і продовжить створювати проблеми, його буде заблоковано, тобто виключено на невизначений термін.</li>
      <li>Модератори можуть на власний розсуд скасувати заборону користувача, якщо це було першим порушенням, і принести скривдженій стороні щирі вибачення.</li>
      <li>Якщо модератор когось забороняє, і ви вважаєте, що це невиправдано, зверніться до цього модератора або до іншого модератора, <strong>в приватному порядку</strong>. Скарги на заборони в каналі не допускаються.
      <li>Модератори дотримуються більш високих стандартів, ніж інші учасники спільноти. Якщо модератор створює недоречну ситуацію, він має очікувати на меншу свободу дій, ніж інші.
    </ol>
    <p>У спільноті Rust ми прагнемо зробити ще один крок, щоб піклуватися одне про одного. Не прагніть бути технічно бездоганними, намагайтеся бути самим собою. Зокрема, уникайте загравати з образливими або делікатними питаннями, особливо якщо вони не за темою; це надто часто призводить до непотрібних бійок, образливих почуттів і підриву довіри; найгірше те, що це може повністю відштовхнути людей від спільноти.</p> <p>.
    <p>І якщо хтось не згоден з тим, що ви сказали або зробили, не піддавайтеся бажанню захищатися. Просто припиніть робити те, на що вони скаржилися, і вибачтеся. Навіть якщо ви відчуваєте, що вас неправильно витлумачили або несправедливо звинуватили, велика ймовірність того, що ви могли краще донести інформацію - пам'ятайте, що ви несете відповідальність за те, щоб ваші друзі-Растаціани були задоволені. Усі хочуть ладнати, і ми всі тут, передусім, тому що ми хочемо поговорити про круті технології. Ви виявите, що люди прагнутимуть добрих намірів і прощатимуть, якщо ви заслужили їхню довіру.</p> <p>Виявите, що люди прагнутимуть добрих намірів і прощатимуть, якщо ви заслужили їхню довіру.
    <p>Політики примусового виконання, перелічені вище, поширюються на всі офіційні майданчики, включно з каналами Discord (https://discord.gg/rust-lang); GitHub репозиторії організацій rust-lang, rust-lang-nursery та rust-lang-deprecated, та всі форуми rust-lang.org (users.rust-lang.org, internals.rust-lang.org). Для інших проектів, які приймають Кодекс поведінки Rust, будь ласка, зв'яжіться з розробниками цих проектів для забезпечення виконання. Якщо ви хочете використовувати цей кодекс поведінки для свого власного проєкту, розгляньте можливість явної згадки вашої політики модерації або створення копії з вашою власною політикою модерації, щоб уникнути плутанини.</p> <p>.
    <p><i>Адаптовано з <a href="http://blog.izs.me/post/30036893703/policy-on-trolling">Node.js Policy on Trolling</a>, а також з <a href="https://www.contributor-covenant.org/version/1/3/0/">Contributor Covenant v1.3.0</a>.</i></p>
coc-moderation-description-team-anchor-text = Команда модераторів Rust
