### Translation file for page: https://www.rust-lang.org/policies/security
### templates/policies/security.hbs

policies-security-page-title = Політика безпеки
security-reporting-heading = Інформування
security-reporting-link = Зв'язатися з { ENGLISH("security@rust-lang.org") }
security-disclosure-heading = Політика розкриття інформації
security-disclosure-description =
    <p>При обробці звітів безпеки виділяється 5 етапів:</p>
    <ol>
      <li>Звіт про безпеку отримано і йому призначено основного обробника. Ця людина буде координувати процес виправлення і випуску.</li>
      <li>Проблему підтверджено та визначено список усіх вразливих версій.</li>
      <li>Код перевіряється на наявність потенційних подібних проблем.</li>
      <li>Виправлення підготовлені для всіх випусків, які все ще обслуговуються. Ці виправлення поки що не доступні громадськості, а скоріше зберігаються локально в очікуванні оголошення.</li>
      <li>У день ембарго <a href="{ -rustlang-security-announcements-google-groups-forum-href }">до списку розсилки з питань безпеки Rust</a> надсилається копія оголошення. Зміни передаються в загальнодоступний репозиторій, а нові збірки розгортаються на rust-lang.org. Протягом 6 годин з моменту отримання списку розсилки, копія рекомендації буде опублікована в блозі Rust.</li>.
    </ol>
    <p>Цей процес може зайняти деякий час, особливо коли потрібна координація з супроводжуючими інших проектів. Буде докладено всіх зусиль для своєчасного усунення помилки, проте важливо, щоб ми дотримувалися описаного вище процесу випуску, щоб гарантувати, що розкриття буде опрацьовано узгодженим чином.</p> <p>.
security-receiving-heading = Отримання оновлень безпеки
security-receiving-description =
    <p>Найкращий спосіб отримувати всі оголошення про безпеку - це підписатися на <a href="{ -rust-security-announcements-mailing-list-href }">список розсилки Rust оголошень про безпеку</a> (альтернативно: надсилання електронного листа на адресу { -rustlang-security-announcements-subscribe-anchor }). У списку розсилки дуже низький трафік, і він отримує публічні повідомлення в момент зняття ембарго.</p>
    <p>Ми оголосимо про вразливості за 72 години до скасування ембарго на { -distros-openwall-email-anchor }, щоб дистрибутиви Linux могли оновлювати свої пакети.</p>
security-pgp-key-heading = PGP ключ у текстовому форматі
